Authentication:
  Fields: "action, app, authentication_method, authentication_method, authentication_service, dest, dest_nt_domain, duration, reason, response_time, signature, signature_id, src, src_user, src_user_role, src_user_type, tag, user, user_agent, user_id, user_role, user_type, vendor_account"
Alerts:
  Fields: "app, body, description, dest, dest_type,id,mitre_technique_id,severity,severity_id,signature,signature_id,src,src_type,subject,type,user,user_name,vendor_account,vendor_region"

Change:
  All_Changes:
    Fields: "action, change_type, command, dest, dvc, image_id, object, object_attrs, object_category, object_id, object_path, result, result_id, src, status, tag, user, user_agent, user_name, user_type, vendor_account, vendor_product, vendor_region"
  Account_Management: 
    Fields: "dest_nt_domain, src_nt_domain, src_user, src_user_name, src_user_type"
  Network_Changes: "dest_ip_range, dest_port_range, direction, rule_action, src_ip_range, src_port_range, device_restarts"

Network Sessions:
  All_Sessions:
    All Fields: "action,dest_dns,dest_ip,dest_mac,dest_nt_host,duration,response_time,signature,signature_id,src_dns,src_ip,src_mac,src_nt_host,user,vendor_product"
  DHCP:
    All Fields: "lease_duration,lease_scope"

Network Traffic:
  All_Traffic: 
    All Fields: "action,app,bytes,bytes_in,bytes_out,channel,dest,dest_interface,dest_ip,dest_mac,dest_port,dest_translated_ip,dest_translate_port,dest_zone,direction,duration,dvc,dvc_ip,dvc_mac,dvc_priority,dvc_zone,flow_id,icmp_code,icmp_type,packets,packets_in,packets_out,process_id,protocol,protocol_version,response_time,rule,session_id,src,src_interface"
    Recommended Fields: "action,bytes,bytes_in,bytes_out,dest,dest_port,dvc,rule,src,src_port,transport,user,vendor_product"
Endpoint:
  Filesystem:
    Fields:
Email:
  All_Email:
    Fields: "action, delay, dest, duration, file_hash, file_name, file_size, internal_message_id, message_id, message_info, orig_dest, orig_recipient, orig_src, process, process_id, protocol, recipient, recipient_count, recipient_domain, recipient_status, response_time, retires, return_addr, size, src, src_user, src_user_domain, status_code, subject, tag, url, user, vendor_product, xdelay, xref"
  Filtering:
    Fields: "filter_action, filter_score, signature, signature_extra, signature_id"
Web:
  Web: "action,app,bytes,bytes_in,bytes_out,cached,category,cookie,dest,dest_port,duration,http_content_type,http_method,http_referrer,http_referrer_domain,http_user_agent,http_user_agent_length,response_time,site,src,status,uri_path,uri_query,url,url_domain,url_length,user,vendor_product"
  Storage: "error_code,operation,storage_name"
