| tstats summariesonly=true values(All_Traffic.action) as action values(All_Traffic.app) as app values(All_Traffic.bytes) as bytes values(All_Traffic.bytes_in) as bytes_in values(All_Traffic.bytes_out) as bytes_out values(All_Traffic.dest) as dest values(All_Traffic.dest_port) as dest_port values(All_Traffic.dvc) as dvc values(All_Traffic.rule) as rule values(All_Traffic.src) as src values(All_Traffic.src_port) as src_port values(All_Traffic.transport) as transport values(All_Traffic.user) as user values(All_Traffic.vendor_product) as vendor_product from datamodel=Network_Traffic by index sourcetype All_Traffic.src